Функция СвернутьТаблицуСКонкатенацией(Таблица,КолонкиГруппировки,КолонкиСуммирования,КолонкиКонкатенации) экспорт
	КопияТЗ = Таблица.Скопировать();
	КопияТЗ.Свернуть(КолонкиГруппировки,КолонкиСуммирования+","+КолонкиКонкатенации);
	
	Для каждого Стр из КопияТЗ Цикл
		ТекущийОтбор = Новый Структура(КолонкиГруппировки);
		ЗаполнитьЗначенияСвойств(ТекущийОтбор,Стр);
		
		ТекущиеСтроки = Таблица.НайтиСтроки(ТекущийОтбор);
		
		
		ТекущаяКонкатенация = Новый ТаблицаЗначений;
		ТекущаяКонкатенация.Колонки.Добавить("ИмяКолонки");
		ТекущаяКонкатенация.Колонки.Добавить("Значение");
		МассивКолонокКонкатенации = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КолонкиКонкатенации);
		Для каждого ЭлМас из МассивКолонокКонкатенации Цикл
			НовСтр = ТекущаяКонкатенация.Добавить();
			НовСтр.ИмяКолонки = ЭлМас;
			НовСтр.Значение = "";
		КонецЦикла;
		
		Для каждого ТекСтр из ТекущиеСтроки Цикл
			Для каждого ТекКолонка из МассивКолонокКонкатенации Цикл
				Строка = ТекущаяКонкатенация.Найти(ТекКолонка);
				Если Строка = неопределено тогда
					Сообщить("Что-то пошло не так");
				КонецЕсли;
				Строка.Значение = Строка.Значение + ТекСтр[ТекКолонка];
			КонецЦикла;
		КонецЦикла;
		
		Для каждого ТекКон из ТекущаяКонкатенация Цикл
			Стр[ТекКон.ИмяКолонки] = ТекКон.Значение;
		КонецЦикла;
		
	КонецЦикла;
	Возврат КопияТЗ;
КонецФункции
